---
type: ReferencePointArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# ReferencePointArray

`Autodesk.Revit.DB.ReferencePointArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ReferencePointArray | — | `public ReferencePointArray ()` |
| Method | Append | — | `public virtual void Append ( ReferencePoint item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual ReferencePointArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( ReferencePoint item , int index )` |
| Method | ReverseIterator | — | `public virtual ReferencePointArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual ReferencePoint this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |